# __contains__(self, x) x in y Возвращает True, если x присутст вует в последовательности y или x является ключом отображения y

# __delitem__(self, k) del y[k] Удаляет kй элемент последова тельности y или элемент с ключом k в отображении y

# __getitem__(self, k) y[k] Возвращает kй элемент последова тельности y или значение элемента с ключом k в отображении y

# __iter__(self) for x in y:
    #pass
# Возвращает итератор по элемен
# там последовательности y или по
# ключам отображения y


# __len__(self) len(y) Возвращает число элементов в y
# __reversed__(self) reversed(y) Возвращает итератор, выполняю щий обход элементов последова тельности y или ключей отображе ния y в обратном порядке
#  __setitem__(self, k, v) y[k] = v Устанавливает kй элемент после довательности y или значение элемента с ключом k в отображении y
